QX-C2000-DSP/f280049revb_evb_examples/libs/driverlib/inc/hw_hradc.h
#ifndef HW_HRADC_H
#define HW_HRADC_H

// ####
//*************************************************************************************************
//
//  The following are defines for the HR_ADC register offsets
//
//*************************************************************************************************
#define HR_ADC_O_CTL1       0x00U // HR_ADC Control Register
#define HR_ADC_O_CTL2       0x04U // HR_ADC Control Register
#define HR_ADC_O_INTFLG     0x08U // HR_ADC Interrupt Flag Register
#define HR_ADC_O_INTFLGCLR  0x0cU // HR_ADC Interrupt Flag Clear Register
#define HR_ADC_O_INTOVF     0x10U // HR_ADC Interrupt Overflow Register
#define HR_ADC_O_INTOVFCLR  0x14U // HR_ADC Interrupt Overflow Clear Register
#define HR_ADC_O_INTSEL1N2  0x18U // HR_ADC Interrupt Selection Register
#define HR_ADC_O_SOCPRICTL  0x1cU // HR_ADC Interrupt Selection Register
#define HR_ADC_O_SOCFLG1    0x20U // HR_ADC Interrupt Selection Register
#define HR_ADC_O_SOCFRC1    0x24U // HR_ADC Interrupt Selection Register
#define HR_ADC_O_SOCOVF1    0x28U // HR_ADC Interrupt Selection Register
#define HR_ADC_O_SOCOVFCLR1 0x2cU // HR_ADC Interrupt Selection Register
#define HR_ADC_O_SOC0CTL    0x30U // HR_ADC SOC0 Control Register
#define HR_ADC_O_SOC1CTL    0x34U // HR_ADC SOC1 Control Register
#define HR_ADC_O_SOC2CTL    0x38U // HR_ADC SOC2 Control Register
#define HR_ADC_O_SOC3CTL    0x3cU // HR_ADC SOC3 Control Register
#define HR_ADC_O_SOC4CTL    0x40U // HR_ADC SOC4 Control Register
#define HR_ADC_O_SOC5CTL    0x44U // HR_ADC SOC5 Control Register
#define HR_ADC_O_SOC6CTL    0x48U // HR_ADC SOC6 Control Register
#define HR_ADC_O_SOC7CTL    0x4cU // HR_ADC SOC7 Control Register
#define HR_ADC_O_SOC8CTL    0x50U // HR_ADC SOC8 Control Register
#define HR_ADC_O_SOC9CTL    0x54U // HR_ADC SOC9 Control Register
#define HR_ADC_O_SOC10CTL   0x58U // HR_ADC SOC10 Control Register
#define HR_ADC_O_SOC11CTL   0x5cU // HR_ADC SOC11 Control Register
#define HR_ADC_O_SOC12CTL   0x60U // HR_ADC SOC12 Control Register
#define HR_ADC_O_SOC13CTL   0x64U // HR_ADC SOC13 Control Register
#define HR_ADC_O_SOC14CTL   0x68U // HR_ADC SOC14 Control Register
#define HR_ADC_O_SOC15CTL   0x6cU // HR_ADC SOC15 Control Register
#define HR_ADC_O_EVTSTAT    0x70U // HR_ADC Event Status Register
#define HR_ADC_O_EVTCLR     0x74U // HR_ADC Event Clear Register
#define HR_ADC_O_EVTSEL     0x78U // HR_ADC Event Selection Register
#define HR_ADC_O_EVTINTSEL  0x7cU // HR_ADC Event Interrupt Selection Register
#define HR_ADC_O_COUNTER    0x80U // HR_ADC Counter Register
#define HR_ADC_O_REV        0x84U // HR_ADC Revision Register
#define HR_ADC_O_PPB1CONFIG 0x88U // HR_ADC PPB1 Configuration Register
#define HR_ADC_O_PPB1STAMP  0x8cU // HR_ADC PPB1 Sample Delay Time Stamp Register
#define HR_ADC_O_PPB1OFFCAL 0x90U // HR_ADC PPB1 Offset Calibration Register
#define HR_ADC_O_PPB1OFFREF 0x94U // HR_ADC PPB1 Offset Reference Register
#define HR_ADC_O_PPB1TRIPHI 0x98U // HR_ADC PPB1 Trip High Register
#define HR_ADC_O_PPB1TRIPLO 0x9cU // HR_ADC PPB1 Trip Low Register
#define HR_ADC_O_PPB2CONFIG 0xa0U // HR_ADC PPB2 Configuration Register
#define HR_ADC_O_PPB2STAMP  0xa4U // HR_ADC PPB2 Sample Delay Time Stamp Register
#define HR_ADC_O_PPB2OFFCAL 0xa8U // HR_ADC PPB2 Offset Calibration Register
#define HR_ADC_O_PPB2OFFREF 0xacU // HR_ADC PPB2 Offset Reference Register
#define HR_ADC_O_PPB2TRIPHI 0xb0U // HR_ADC PPB2 Trip High Register
#define HR_ADC_O_PPB2TRIPLO 0xb4U // HR_ADC PPB2 Trip Low Register
#define HR_ADC_O_PPB3CONFIG 0xb8U // HR_ADC PPB3 Configuration Register
#define HR_ADC_O_PPB3STAMP  0xbcU // HR_ADC PPB3 Sample Delay Time Stamp Register
#define HR_ADC_O_PPB3OFFCAL 0xc0U // HR_ADC PPB3 Offset Calibration Register
#define HR_ADC_O_PPB3OFFREF 0xc4U // HR_ADC PPB3 Offset Reference Register
#define HR_ADC_O_PPB3TRIPHI 0xc8U // HR_ADC PPB3 Trip High Register
#define HR_ADC_O_PPB3TRIPLO 0xccU // HR_ADC PPB3 Trip Low Register
#define HR_ADC_O_PPB4CONFIG 0xd0U // HR_ADC PPB4 Configuration Register
#define HR_ADC_O_PPB4STAMP  0xd4U // HR_ADC PPB4 Sample Delay Time Stamp Register
#define HR_ADC_O_PPB4OFFCAL 0xd8U // HR_ADC PPB4 Offset Calibration Register
#define HR_ADC_O_PPB4OFFREF 0xdcU // HR_ADC PPB4 Offset Reference Register
#define HR_ADC_O_PPB4TRIPHI 0xe0U // HR_ADC PPB4 Trip High Register
#define HR_ADC_O_PPB4TRIPLO 0xe4U // HR_ADC PPB4 Trip Low Register
#define HR_ADC_O_BURSTCTL   0xe8U // HR_ADC Burst Register
#define HR_ADC_O_INTSOCSEL  0xecU // HR_ADC INTSOCSEL Register

#define HR_ADC_O_RESULT0  0x00U // HR_ADC Result 0 Register
#define HR_ADC_O_RESULT1  0x04U // HR_ADC Result 1 Register
#define HR_ADC_O_RESULT2  0x08U // HR_ADC Result 2 Register
#define HR_ADC_O_RESULT3  0x0cU // HR_ADC Result 3 Register
#define HR_ADC_O_RESULT4  0x10U // HR_ADC Result 4 Register
#define HR_ADC_O_RESULT5  0x14U // HR_ADC Result 5 Register
#define HR_ADC_O_RESULT6  0x18U // HR_ADC Result 6 Register
#define HR_ADC_O_RESULT7  0x1cU // HR_ADC Result 7 Register
#define HR_ADC_O_RESULT8  0x20U // HR_ADC Result 8 Register
#define HR_ADC_O_RESULT9  0x24U // HR_ADC Result 9 Register
#define HR_ADC_O_RESULT10 0x28U // HR_ADC Result 10 Register
#define HR_ADC_O_RESULT11 0x2cU // HR_ADC Result 11 Register
#define HR_ADC_O_RESULT12 0x30U // HR_ADC Result 12 Register
#define HR_ADC_O_RESULT13 0x34U // HR_ADC Result 13 Register
#define HR_ADC_O_RESULT14 0x38U // HR_ADC Result 14 Register
#define HR_ADC_O_RESULT15 0x3cU // HR_ADC Result 15 Register

#define HR_ADC_O_PPB1RESULT 0x150U // HR_ADC PPB1 Result Register
#define HR_ADC_O_PPB2RESULT 0x154U // HR_ADC PPB2 Result Register
#define HR_ADC_O_PPB3RESULT 0x158U // HR_ADC PPB3 Result Register
#define HR_ADC_O_PPB4RESULT 0x15cU // HR_ADC PPB4 Result Register

//*************************************************************************************************
//
// The following are defines for the bit fields in the HR_ADCCTL1 register
//
//*************************************************************************************************
#define HR_ADC_CTL1_RESTART_P      0x2U
#define HR_ADC_CTL1_INTPULSEPOS    0x4U
#define HR_ADC_CTL1_DISLVL         0x8U
#define HR_ADC_CTL1_ENLDO          0x10U
#define HR_ADC_CTL1_STARTCAL_P     0x20U
#define HR_ADC_CTL1_RESERZ_P       0x40U
#define HR_ADC_CTL1_ADC_EN_P       0x80U
#define HR_ADC_CTL1_ADC_BUSYCHAN_S 8U
#define HR_ADC_CTL1_ADC_BUSYCHAN_M 0xf00U
#define HR_ADC_CTL1_SELREF_LDO     0x1000U
#define HR_ADC_CTL1_ADCBSY         0x2000U
#define HR_ADC_CTL1_SELRANGE_LDO   0x4000U
#define HR_ADC_CTL1_STARTOSCAL_P   0x8000U
#define HR_ADC_CTL1_PG             0x10000U
#define HR_ADC_CTL1_ADCRDY         0x20000U
#define HR_ADC_CTL1_REARM_CNTREF_S 17U
#define HR_ADC_CTL1_PRESCALE_M     0x7ffc0000U

//*************************************************************************************************

//*************************************************************************************************
//
// The following are defines for the bit fields in the HR_ADCCTL2 register
//
//*************************************************************************************************

#define HR_ADC_CTL2_PRESCALE_M     0x1FU
#define HR_ADC_CTL2_SELRES_S       5U
#define HR_ADC_CTL2_SELRES_M       0x60U
#define HR_ADC_CTL2_SELDIFF        0x80U
#define HR_ADC_CTL2_PRESCALEPCLK_M 0x1F00U

//*************************************************************************************************

//
// The following are defines for the bit fields in the HR_ADCBURSTCTL register
//
//*************************************************************************************************
#define HR_ADC_BURSTCTL_BURSTTRIGSEL_S 0U
#define HR_ADC_BURSTCTL_BURSTTRIGSEL_M 0x3FU // SOC Burst Trigger Source Select
#define HR_ADC_BURSTCTL_BURSTSIZE_S    8U
#define HR_ADC_BURSTCTL_BURSTSIZE_M    0xF00U  // SOC Burst Size Select
#define HR_ADC_BURSTCTL_BURSTEN        0x8000U // SOC Burst Mode Enable

//*************************************************************************************************
//
// The following are defines for the bit fields in the HR_ADCINTSOCSEL register
//
//*************************************************************************************************
#define HR_ADC_INTSOCSEL1_SOC0_S  0U
#define HR_ADC_INTSOCSEL1_SOC0_M  0x3U
#define HR_ADC_INTSOCSEL1_SOC1_S  2U
#define HR_ADC_INTSOCSEL1_SOC1_M  0x3U
#define HR_ADC_INTSOCSEL1_SOC2_S  4U
#define HR_ADC_INTSOCSEL1_SOC2_M  0x3U
#define HR_ADC_INTSOCSEL1_SOC3_S  6U
#define HR_ADC_INTSOCSEL1_SOC3_M  0x3U
#define HR_ADC_INTSOCSEL1_SOC4_S  8U
#define HR_ADC_INTSOCSEL1_SOC4_M  0x3U
#define HR_ADC_INTSOCSEL1_SOC5_S  10U
#define HR_ADC_INTSOCSEL1_SOC5_M  0x3U
#define HR_ADC_INTSOCSEL1_SOC6_S  12U
#define HR_ADC_INTSOCSEL1_SOC6_M  0x3U
#define HR_ADC_INTSOCSEL1_SOC7_S  14U
#define HR_ADC_INTSOCSEL1_SOC7_M  0x3U
#define HR_ADC_INTSOCSEL1_SOC8_S  16U
#define HR_ADC_INTSOCSEL1_SOC8_M  0x3U
#define HR_ADC_INTSOCSEL1_SOC9_S  18U
#define HR_ADC_INTSOCSEL1_SOC9_M  0x3U
#define HR_ADC_INTSOCSEL1_SOC10_S 20U
#define HR_ADC_INTSOCSEL1_SOC10_M 0x3U
#define HR_ADC_INTSOCSEL1_SOC11_S 22U
#define HR_ADC_INTSOCSEL1_SOC11_M 0x3U
#define HR_ADC_INTSOCSEL1_SOC12_S 24U
#define HR_ADC_INTSOCSEL1_SOC12_M 0x3U
#define HR_ADC_INTSOCSEL1_SOC13_S 26U
#define HR_ADC_INTSOCSEL1_SOC13_M 0x3U
#define HR_ADC_INTSOCSEL1_SOC14_S 28U
#define HR_ADC_INTSOCSEL1_SOC14_M 0x3U
#define HR_ADC_INTSOCSEL1_SOC15_S 30U
#define HR_ADC_INTSOCSEL1_SOC15_M 0x3U
//*************************************************************************************************
//
// The following are defines for the bit fields in the HR_ADCSOCPRICTL register
//
//*************************************************************************************************
#define HR_ADCSOCPRICTL_SOCPRIORITY_M 0x1FU // HR_ADC SOCPRIORITY
#define HR_ADCSOCPRICTL_RRPOINTER_S   5U    // HR_ADC RRPOINTER start bit
#define HR_ADCSOCPRICTL_RRPOINTER_M   0x3eU // HR_ADC RRPOINTER mask

//*************************************************************************************************
//
// The following are defines for the bit fields in the HR_ADCINTFLG register
//
//*************************************************************************************************
#define HR_ADC_INTFLG_ADCINT1 0x1U // HR_ADC Interrupt 1 Flag
#define HR_ADC_INTFLG_ADCINT2 0x2U // HR_ADC Interrupt 2 Flag
#define HR_ADC_INTFLG_ADCINT3 0x4U // HR_ADC Interrupt 3 Flag
#define HR_ADC_INTFLG_ADCINT4 0x8U // HR_ADC Interrupt 4 Flag

//*************************************************************************************************
//
// The following are defines for the bit fields in the HR_ADCINTFLGCLR register
//
//*************************************************************************************************
#define HR_ADC_INTFLGCLR_ADCINT1 0x1U // HR_ADC Interrupt 1 Flag Clear
#define HR_ADC_INTFLGCLR_ADCINT2 0x2U // HR_ADC Interrupt 2 Flag Clear
#define HR_ADC_INTFLGCLR_ADCINT3 0x4U // HR_ADC Interrupt 3 Flag Clear
#define HR_ADC_INTFLGCLR_ADCINT4 0x8U // HR_ADC Interrupt 4 Flag Clear

//*************************************************************************************************
//
// The following are defines for the bit fields in the HR_ADCINTOVF register
//
//*************************************************************************************************
#define HR_ADC_INTOVF_ADCINT1 0x1U // HR_ADC Interrupt 1 Overflow Flags
#define HR_ADC_INTOVF_ADCINT2 0x2U // HR_ADC Interrupt 2 Overflow Flags
#define HR_ADC_INTOVF_ADCINT3 0x4U // HR_ADC Interrupt 3 Overflow Flags
#define HR_ADC_INTOVF_ADCINT4 0x8U // HR_ADC Interrupt 4 Overflow Flags

//*************************************************************************************************
//
// The following are defines for the bit fields in the HR_ADCINTOVFCLR register
//
//*************************************************************************************************
#define HR_ADC_INTOVFCLR_ADCINT1 0x1U // HR_ADC Interrupt 1 Overflow Clear Bits
#define HR_ADC_INTOVFCLR_ADCINT2 0x2U // HR_ADC Interrupt 2 Overflow Clear Bits
#define HR_ADC_INTOVFCLR_ADCINT3 0x4U // HR_ADC Interrupt 3 Overflow Clear Bits
#define HR_ADC_INTOVFCLR_ADCINT4 0x8U // HR_ADC Interrupt 4 Overflow Clear Bits

//*************************************************************************************************
//
// The following are defines for the bit fields in the HR_ADCINTSEL register
//
//*************************************************************************************************
#define HR_ADC_INTSEL1N2_INT1SEL_S 0U
#define HR_ADC_INTSEL1N2_INT1SEL_M 0x1fU // HR_ADCINT1 EOC Source Select
#define HR_ADC_INTSEL1N2_INT1E     0x20U // HR_ADCINT1 Interrupt Enable
#define HR_ADC_INTSEL1N2_INT1CONT  0x40U // HR_ADCINT1 Continue to Interrupt Mode
#define HR_ADC_INTSEL1N2_INT2SEL_S 8U
#define HR_ADC_INTSEL1N2_INT2SEL_M 0x1f00U // HR_ADCINT2 EOC Source Select
#define HR_ADC_INTSEL1N2_INT2E     0x2000U // HR_ADCINT2 Interrupt Enable
#define HR_ADC_INTSEL1N2_INT2CONT  0x4000U // HR_ADCINT2 Continue to Interrupt Mode
#define HR_ADC_INTSEL1N2_INT3SEL_S 16U
#define HR_ADC_INTSEL1N2_INT3SEL_M 0x1f0000U // HR_ADCINT1 EOC Source Select
#define HR_ADC_INTSEL1N2_INT3E     0x200000U // HR_ADCINT1 Interrupt Enable
#define HR_ADC_INTSEL1N2_INT3CONT  0x400000U // HR_ADCINT1 Continue to Interrupt Mode
#define HR_ADC_INTSEL1N2_INT4SEL_S 24U
#define HR_ADC_INTSEL1N2_INT4SEL_M 0x1f000000U // HR_ADCINT2 EOC Source Select
#define HR_ADC_INTSEL1N2_INT4E     0x20000000U // HR_ADCINT2 Interrupt Enable
#define HR_ADC_INTSEL1N2_INT4CONT  0x40000000U // HR_ADCINT2 Continue to Interrupt Mode

//*************************************************************************************************
//
// The following are defines for the bit fields in the HR_ADCSOC0CTL register
//
//*************************************************************************************************
#define HR_ADC_SOC0CTL_CHSEL_S   15U
#define HR_ADC_SOC0CTL_CHSEL_M   0x78000U // SOC0 Channel Select
#define HR_ADC_SOC0CTL_TRIGSEL_S 20U
#define HR_ADC_SOC0CTL_TRIGSEL_M 0x1f00000U // SOC0 Trigger Source Select

//*************************************************************************************************
//
// The following are defines for the bit fields in the HR_ADCSOC1CTL register
//
//*************************************************************************************************
#define HR_ADC_SOC1CTL_CHSEL_S   12U
#define HR_ADC_SOC1CTL_CHSEL_M   0x1f000U // SOC1 Channel Select
#define HR_ADC_SOC1CTL_TRIGSEL_S 3U
#define HR_ADC_SOC1CTL_TRIGSEL_M 0xF8U // SOC1 Trigger Source Select
#define HR_ADC_SOC1CTL_ACQPS_S   8U
#define HR_ADC_SOC1CTL_ACQPS_M   0xF00U // SOC1 Acquisition Prescale

//*************************************************************************************************
//
// The following are defines for the bit fields in the HR_ADCSOC2CTL register
//
//*************************************************************************************************
#define HR_ADC_SOC2CTL_CHSEL_S   12U
#define HR_ADC_SOC2CTL_CHSEL_M   0x1f000U // SOC2 Channel Select
#define HR_ADC_SOC2CTL_TRIGSEL_S 3U
#define HR_ADC_SOC2CTL_TRIGSEL_M 0xF8U // SOC2 Trigger Source Select
#define HR_ADC_SOC2CTL_ACQPS_S   8U
#define HR_ADC_SOC2CTL_ACQPS_M   0xF00U // SOC2 Acquisition Prescale

//*************************************************************************************************
//
// The following are defines for the bit fields in the HR_ADCSOC3CTL register
//
//*************************************************************************************************
#define HR_ADC_SOC3CTL_CHSEL_S   12U
#define HR_ADC_SOC3CTL_CHSEL_M   0x1f000U // SOC3 Channel Select
#define HR_ADC_SOC3CTL_TRIGSEL_S 3U
#define HR_ADC_SOC3CTL_TRIGSEL_M 0xF8U // SOC3 Trigger Source Select
#define HR_ADC_SOC3CTL_ACQPS_S   8U
#define HR_ADC_SOC3CTL_ACQPS_M   0xF00U // SOC3 Acquisition Prescale

//*************************************************************************************************
//
// The following are defines for the bit fields in the HR_ADCSOC4CTL register
//
//*************************************************************************************************
#define HR_ADC_SOC4CTL_CHSEL_S   12U
#define HR_ADC_SOC4CTL_CHSEL_M   0x1f000U // SOC4 Channel Select
#define HR_ADC_SOC4CTL_TRIGSEL_S 3U
#define HR_ADC_SOC4CTL_TRIGSEL_M 0xF8U // SOC4 Trigger Source Select
#define HR_ADC_SOC4CTL_ACQPS_S   8U
#define HR_ADC_SOC4CTL_ACQPS_M   0xF00U // SOC4 Acquisition Prescale

//*************************************************************************************************
//
// The following are defines for the bit fields in the HR_ADCSOC5CTL register
//
//*************************************************************************************************
#define HR_ADC_SOC5CTL_CHSEL_S   12U
#define HR_ADC_SOC5CTL_CHSEL_M   0x1f000U // SOC5 Channel Select
#define HR_ADC_SOC5CTL_TRIGSEL_S 3U
#define HR_ADC_SOC5CTL_TRIGSEL_M 0xF8U // SOC5 Trigger Source Select
#define HR_ADC_SOC5CTL_ACQPS_S   8U
#define HR_ADC_SOC5CTL_ACQPS_M   0xF00U // SOC5 Acquisition Prescale

//*************************************************************************************************
//
// The following are defines for the bit fields in the HR_ADCSOC6CTL register
//
//*************************************************************************************************
#define HR_ADC_SOC6CTL_CHSEL_S   12U
#define HR_ADC_SOC6CTL_CHSEL_M   0x1f000U // SOC6 Channel Select
#define HR_ADC_SOC6CTL_TRIGSEL_S 3U
#define HR_ADC_SOC6CTL_TRIGSEL_M 0xF8U // SOC6 Trigger Source Select
#define HR_ADC_SOC6CTL_ACQPS_S   8U
#define HR_ADC_SOC6CTL_ACQPS_M   0xF00U // SOC6 Acquisition Prescale

//*************************************************************************************************
//
// The following are defines for the bit fields in the HR_ADCSOC7CTL register
//
//*************************************************************************************************
#define HR_ADC_SOC7CTL_CHSEL_S   12U
#define HR_ADC_SOC7CTL_CHSEL_M   0x1f000U // SOC7 Channel Select
#define HR_ADC_SOC7CTL_TRIGSEL_S 3U
#define HR_ADC_SOC7CTL_TRIGSEL_M 0xF8U // SOC7 Trigger Source Select
#define HR_ADC_SOC7CTL_ACQPS_S   8U
#define HR_ADC_SOC7CTL_ACQPS_M   0xF00U // SOC7 Acquisition Prescale

//*************************************************************************************************
//
// The following are defines for the bit fields in the HR_ADCSOC8CTL register
//
//*************************************************************************************************
#define HR_ADC_SOC8CTL_CHSEL_S   12U
#define HR_ADC_SOC8CTL_CHSEL_M   0x1f000U // SOC8 Channel Select
#define HR_ADC_SOC8CTL_TRIGSEL_S 3U
#define HR_ADC_SOC8CTL_TRIGSEL_M 0xF8U // SOC8 Trigger Source Select
#define HR_ADC_SOC8CTL_ACQPS_S   8U
#define HR_ADC_SOC8CTL_ACQPS_M   0xF00U // SOC8 Acquisition Prescale

//*************************************************************************************************
//
// The following are defines for the bit fields in the HR_ADCSOC9CTL register
//
//*************************************************************************************************
#define HR_ADC_SOC9CTL_CHSEL_S   12U
#define HR_ADC_SOC9CTL_CHSEL_M   0x1f000U // SOC9 Channel Select
#define HR_ADC_SOC9CTL_TRIGSEL_S 3U
#define HR_ADC_SOC9CTL_TRIGSEL_M 0xF8U // SOC9 Trigger Source Select
#define HR_ADC_SOC9CTL_ACQPS_S   8U
#define HR_ADC_SOC9CTL_ACQPS_M   0xF00U // SOC9 Acquisition Prescale

//*************************************************************************************************
//
// The following are defines for the bit fields in the HR_ADCSOC10CTL register
//
//*************************************************************************************************
#define HR_ADC_SOC10CTL_CHSEL_S   12U
#define HR_ADC_SOC10CTL_CHSEL_M   0x1f000U // SOC10 Channel Select
#define HR_ADC_SOC10CTL_TRIGSEL_S 3U
#define HR_ADC_SOC10CTL_TRIGSEL_M 0xF8U // SOC10 Trigger Source Select
#define HR_ADC_SOC10CTL_ACQPS_S   8U
#define HR_ADC_SOC10CTL_ACQPS_M   0xF00U // SOC10 Acquisition Prescale

//*************************************************************************************************
//
// The following are defines for the bit fields in the HR_ADCSOC11CTL register
//
//*************************************************************************************************
#define HR_ADC_SOC11CTL_CHSEL_S   12U
#define HR_ADC_SOC11CTL_CHSEL_M   0x1f000U // SOC11 Channel Select
#define HR_ADC_SOC11CTL_TRIGSEL_S 3U
#define HR_ADC_SOC11CTL_TRIGSEL_M 0xF8U // SOC11 Trigger Source Select
#define HR_ADC_SOC11CTL_ACQPS_S   8U
#define HR_ADC_SOC11CTL_ACQPS_M   0xF00U // SOC11 Acquisition Prescale

//*************************************************************************************************
//
// The following are defines for the bit fields in the HR_ADCSOC12CTL register
//
//*************************************************************************************************
#define HR_ADC_SOC12CTL_CHSEL_S   12U
#define HR_ADC_SOC12CTL_CHSEL_M   0x1f000U // SOC12 Channel Select
#define HR_ADC_SOC12CTL_TRIGSEL_S 3U
#define HR_ADC_SOC12CTL_TRIGSEL_M 0xF8U // SOC12 Trigger Source Select
#define HR_ADC_SOC12CTL_ACQPS_S   8U
#define HR_ADC_SOC12CTL_ACQPS_M   0xF00U // SOC12 Acquisition Prescale

//*************************************************************************************************
//
// The following are defines for the bit fields in the HR_ADCSOC13CTL register
//
//*************************************************************************************************
#define HR_ADC_SOC13CTL_CHSEL_S   12U
#define HR_ADC_SOC13CTL_CHSEL_M   0x1f000U // SOC13 Channel Select
#define HR_ADC_SOC13CTL_TRIGSEL_S 3U
#define HR_ADC_SOC13CTL_TRIGSEL_M 0xF8U // SOC13 Trigger Source Select
#define HR_ADC_SOC13CTL_ACQPS_S   8U
#define HR_ADC_SOC13CTL_ACQPS_M   0xF00U // SOC13 Acquisition Prescale

//*************************************************************************************************
//
// The following are defines for the bit fields in the HR_ADCSOC14CTL register
//
//*************************************************************************************************
#define HR_ADC_SOC14CTL_CHSEL_S   12U
#define HR_ADC_SOC14CTL_CHSEL_M   0x1f000U // SOC14 Channel Select
#define HR_ADC_SOC14CTL_TRIGSEL_S 3U
#define HR_ADC_SOC14CTL_TRIGSEL_M 0xF8U // SOC14 Trigger Source Select
#define HR_ADC_SOC14CTL_ACQPS_S   8U
#define HR_ADC_SOC14CTL_ACQPS_M   0xF00U // SOC14 Acquisition Prescale

//*************************************************************************************************
//
// The following are defines for the bit fields in the HR_ADCSOC15CTL register
//
//*************************************************************************************************
#define HR_ADC_SOC15CTL_CHSEL_S   12U
#define HR_ADC_SOC15CTL_CHSEL_M   0x1f000U // SOC15 Channel Select
#define HR_ADC_SOC15CTL_TRIGSEL_S 3U
#define HR_ADC_SOC15CTL_TRIGSEL_M 0xF8U // SOC15 Trigger Source Select
#define HR_ADC_SOC15CTL_ACQPS_S   8U
#define HR_ADC_SOC15CTL_ACQPS_M   0xF00U // SOC15 Acquisition Prescale

