QX-C2000-DSP/f280049revb_evb_examples/libs/driverlib/inc/hw_hradc.h
//*************************************************************************************************
//
// The following are defines for the bit fields in the HR_ADCSOC16CTL register
//
//*************************************************************************************************
#define HR_ADC_SOC16CTL_CHSEL_S   12U
#define HR_ADC_SOC16CTL_CHSEL_M   0x1f000U // SOC16 Channel Select
#define HR_ADC_SOC16CTL_TRIGSEL_S 3U
#define HR_ADC_SOC16CTL_TRIGSEL_M 0xF8U // SOC16 Trigger Source Select
#define HR_ADC_SOC16CTL_ACQPS_S   8U
#define HR_ADC_SOC16CTL_ACQPS_M   0xF00U // SOC16 Acquisition Prescale

//*************************************************************************************************
//
// The following are defines for the bit fields in the HR_ADCSOC17CTL register
//
//*************************************************************************************************
#define HR_ADC_SOC17CTL_CHSEL_S   12U
#define HR_ADC_SOC17CTL_CHSEL_M   0x1f000U // SOC17 Channel Select
#define HR_ADC_SOC17CTL_TRIGSEL_S 3U
#define HR_ADC_SOC17CTL_TRIGSEL_M 0xF8U // SOC17 Trigger Source Select
#define HR_ADC_SOC17CTL_ACQPS_S   8U
#define HR_ADC_SOC17CTL_ACQPS_M   0xF00U // SOC17 Acquisition Prescale

//*************************************************************************************************
//
// The following are defines for the bit fields in the HR_ADCSOC18CTL register
//
//*************************************************************************************************
#define HR_ADC_SOC18CTL_CHSEL_S   12U
#define HR_ADC_SOC18CTL_CHSEL_M   0x1f000U // SOC18 Channel Select
#define HR_ADC_SOC18CTL_TRIGSEL_S 3U
#define HR_ADC_SOC18CTL_TRIGSEL_M 0xF8U // SOC18 Trigger Source Select
#define HR_ADC_SOC18CTL_ACQPS_S   8U
#define HR_ADC_SOC18CTL_ACQPS_M   0xF00U // SOC18 Acquisition Prescale

//*************************************************************************************************
//
// The following are defines for the bit fields in the HR_ADCSOC19CTL register
//
//*************************************************************************************************
#define HR_ADC_SOC19CTL_CHSEL_S   12U
#define HR_ADC_SOC19CTL_CHSEL_M   0x1f000U // SOC19 Channel Select
#define HR_ADC_SOC19CTL_TRIGSEL_S 3U
#define HR_ADC_SOC19CTL_TRIGSEL_M 0xF8U // SOC19 Trigger Source Select
#define HR_ADC_SOC19CTL_ACQPS_S   8U
#define HR_ADC_SOC19CTL_ACQPS_M   0xF00U // SOC19 Acquisition Prescale

//*************************************************************************************************
//
// The following are defines for the bit fields in the HR_ADCEVTSTAT register
//
//*************************************************************************************************
#define HR_ADC_EVTSTAT_PPB1TRIPHI 0x1U   // Post Processing Block 1 Trip High Flag
#define HR_ADC_EVTSTAT_PPB1TRIPLO 0x2U   // Post Processing Block 1 Trip Low Flag
#define HR_ADC_EVTSTAT_PPB1ZERO   0x4U   // Post Processing Block 1 Zero Crossing Flag
#define HR_ADC_EVTSTAT_PPB2TRIPHI 0x8U   // Post Processing Block 2 Trip High Flag
#define HR_ADC_EVTSTAT_PPB2TRIPLO 0x10U  // Post Processing Block 2 Trip Low Flag
#define HR_ADC_EVTSTAT_PPB2ZERO   0x20U  // Post Processing Block 2 Zero Crossing Flag
#define HR_ADC_EVTSTAT_PPB3TRIPHI 0x40U  // Post Processing Block 3 Trip High Flag
#define HR_ADC_EVTSTAT_PPB3TRIPLO 0x80U  // Post Processing Block 3 Trip Low Flag
#define HR_ADC_EVTSTAT_PPB3ZERO   0x100U // Post Processing Block 3 Zero Crossing Flag
#define HR_ADC_EVTSTAT_PPB4TRIPHI 0x200U // Post Processing Block 4 Trip High Flag
#define HR_ADC_EVTSTAT_PPB4TRIPLO 0x400U // Post Processing Block 4 Trip Low Flag
#define HR_ADC_EVTSTAT_PPB4ZERO   0x800U // Post Processing Block 4 Zero Crossing Flag

//*************************************************************************************************
//
// The following are defines for the bit fields in the HR_ADCEVTCLR register
//
//*************************************************************************************************
#define HR_ADC_EVTCLR_PPB1TRIPHI 0x1U   // Post Processing Block 1 Trip High Flag Clear
#define HR_ADC_EVTCLR_PPB1TRIPLO 0x2U   // Post Processing Block 1 Trip Low Flag Clear
#define HR_ADC_EVTCLR_PPB1ZERO   0x4U   // Post Processing Block 1 Zero Crossing Flag Clear
#define HR_ADC_EVTCLR_PPB2TRIPHI 0x8U   // Post Processing Block 2 Trip High Flag Clear
#define HR_ADC_EVTCLR_PPB2TRIPLO 0x10U  // Post Processing Block 2 Trip Low Flag Clear
#define HR_ADC_EVTCLR_PPB2ZERO   0x20U  // Post Processing Block 2 Zero Crossing Flag Clear
#define HR_ADC_EVTCLR_PPB3TRIPHI 0x40U  // Post Processing Block 3 Trip High Flag Clear
#define HR_ADC_EVTCLR_PPB3TRIPLO 0x80U  // Post Processing Block 3 Trip Low Flag Clear
#define HR_ADC_EVTCLR_PPB3ZERO   0x100U // Post Processing Block 3 Zero Crossing Flag Clear
#define HR_ADC_EVTCLR_PPB4TRIPHI 0x200U // Post Processing Block 4 Trip High Flag Clear
#define HR_ADC_EVTCLR_PPB4TRIPLO 0x400U // Post Processing Block 4 Trip Low Flag Clear
#define HR_ADC_EVTCLR_PPB4ZERO   0x800U // Post Processing Block 4 Zero Crossing Flag Clear

//*************************************************************************************************
//
// The following are defines for the bit fields in the HR_ADCEVTSEL register
//
//*************************************************************************************************
#define HR_ADC_EVTSEL_PPB1TRIPHI 0x1U   // Post Processing Block 1 Trip High Flag Select
#define HR_ADC_EVTSEL_PPB1TRIPLO 0x2U   // Post Processing Block 1 Trip Low Flag Select
#define HR_ADC_EVTSEL_PPB1ZERO   0x4U   // Post Processing Block 1 Zero Crossing Flag Select
#define HR_ADC_EVTSEL_PPB2TRIPHI 0x8U   // Post Processing Block 2 Trip High Flag Select
#define HR_ADC_EVTSEL_PPB2TRIPLO 0x10U  // Post Processing Block 2 Trip Low Flag Select
#define HR_ADC_EVTSEL_PPB2ZERO   0x20U  // Post Processing Block 2 Zero Crossing Flag Select
#define HR_ADC_EVTSEL_PPB3TRIPHI 0x40U  // Post Processing Block 3 Trip High Flag Select
#define HR_ADC_EVTSEL_PPB3TRIPLO 0x80U  // Post Processing Block 3 Trip Low Flag Select
#define HR_ADC_EVTSEL_PPB3ZERO   0x100U // Post Processing Block 3 Zero Crossing Flag Select
#define HR_ADC_EVTSEL_PPB4TRIPHI 0x200U // Post Processing Block 4 Trip High Flag Select
#define HR_ADC_EVTSEL_PPB4TRIPLO 0x400U // Post Processing Block 4 Trip Low Flag Select
#define HR_ADC_EVTSEL_PPB4ZERO   0x800U // Post Processing Block 4 Zero Crossing Flag Select

//*************************************************************************************************
//
// The following are defines for the bit fields in the HR_ADCEVTINTSEL register
//
//*************************************************************************************************
#define HR_ADC_EVTINTSEL_PPB1TRIPHI 0x1U // Post Processing Block 1 Trip High Flag Interrupt Select
#define HR_ADC_EVTINTSEL_PPB1TRIPLO 0x2U // Post Processing Block 1 Trip Low Flag Interrupt Select
#define HR_ADC_EVTINTSEL_PPB1ZERO \
    0x4U // Post Processing Block 1 Zero Crossing Flag Interrupt Select
#define HR_ADC_EVTINTSEL_PPB2TRIPHI 0x8U  // Post Processing Block 2 Trip High Flag Interrupt Select
#define HR_ADC_EVTINTSEL_PPB2TRIPLO 0x10U // Post Processing Block 2 Trip Low Flag Interrupt Select
#define HR_ADC_EVTINTSEL_PPB2ZERO \
    0x20U // Post Processing Block 2 Zero Crossing Flag Interrupt Select
#define HR_ADC_EVTINTSEL_PPB3TRIPHI 0x40U // Post Processing Block 3 Trip High Flag Interrupt Select
#define HR_ADC_EVTINTSEL_PPB3TRIPLO 0x80U // Post Processing Block 3 Trip Low Flag Interrupt Select
#define HR_ADC_EVTINTSEL_PPB3ZERO \
    0x100U // Post Processing Block 3 Zero Crossing Flag Interrupt Select
#define HR_ADC_EVTINTSEL_PPB4TRIPHI \
    0x200U // Post Processing Block 4 Trip High Flag Interrupt Select
#define HR_ADC_EVTINTSEL_PPB4TRIPLO 0x400U // Post Processing Block 4 Trip Low Flag Interrupt Select
#define HR_ADC_EVTINTSEL_PPB4ZERO \
    0x800U // Post Processing Block 4 Zero Crossing Flag Interrupt Select

//*************************************************************************************************
//
// The following are defines for the bit fields in the HR_ADCCOUNTER register
//
//*************************************************************************************************
#define HR_ADC_COUNTER_FREECOUNT_S 0U
#define HR_ADC_COUNTER_FREECOUNT_M 0xFFFU // HR_ADC Free Running Counter Value

//*************************************************************************************************
//
// The following are defines for the bit fields in the HR_ADCREV register
//
//*************************************************************************************************
#define HR_ADC_REV_TYPE_S 0U
#define HR_ADC_REV_TYPE_M 0xFFU // HR_ADC Type
#define HR_ADC_REV_REV_S  8U
#define HR_ADC_REV_REV_M  0xFF00U // HR_ADC Revision

//*************************************************************************************************
//
// The following are defines for the bit fields in the HR_ADCPPBCONFIG register
//
//*************************************************************************************************
#define HR_ADC_PPB1CONFIG_CONFIG_S   0U
#define HR_ADC_PPB1CONFIG_CONFIG_M   0x1fU // HR_ADC Post Processing Block 1 Configuration
#define HR_ADC_PPB1CONFIG_TWOSCOMPEN 0x20U // HR_ADC Post Processing Block 1 Two's Complement Enable
#define HR_ADC_PPB1CONFIG_CBCEN      0x40U // HR_ADC Post Processing Block 1 Cycle By Cycle Enable

//*************************************************************************************************
//
// The following are defines for the bit fields in the HR_ADCPPBSTAMP register
//
//*************************************************************************************************
#define HR_ADC_PPB1STAMP_DLYSTAMP_S 0U
#define HR_ADC_PPB1STAMP_DLYSTAMP_M 0xFFFU // HR_ADC Post Processing Block 1 Delay Time Stamp

//*************************************************************************************************
//
// The following are defines for the bit fields in the HR_ADCPPBOFFREF register
//
//*************************************************************************************************
#define HR_ADC_PPB1OFFREF_OFFREF_S 0U
#define HR_ADC_PPB1OFFREF_OFFREF_M 0xFFFFU // HR_ADC Post Processing Block 1 Offset Correction

//*************************************************************************************************
//
// The following are defines for the bit fields in the HR_ADCPPBTRIPHI register
//
//*************************************************************************************************
#define HR_ADC_PPB1TRIPHI_LIMITHI_S 0U
#define HR_ADC_PPB1TRIPHI_LIMITHI_M 0xFFFU  // HR_ADC Post Processing Block 1 Trip High Limit
#define HR_ADC_PPB1TRIPHI_HSIGN     0x1000U // HR_ADC Post Processing Block 1 High Limit Sign Bit

//*************************************************************************************************
//
// The following are defines for the bit fields in the HR_ADCPPBTRIPLO register
//
//*************************************************************************************************
#define HR_ADC_PPB1TRIPLO_LIMITLO_S  0U
#define HR_ADC_PPB1TRIPLO_LIMITLO_M  0xFFFU  // HR_ADC Post Processing Block 1 Trip Low Limit
#define HR_ADC_PPB1TRIPLO_LSIGN      0x1000U // HR_ADC Post Processing Block 1 Low Limit Sign Bit
#define HR_ADC_PPB1TRIPLO_REQSTAMP_S 20U
#define HR_ADC_PPB1TRIPLO_REQSTAMP_M \
    0xFFF00000U // HR_ADC Post Processing Block 1 Request Time Stamp

//*************************************************************************************************
//
// The following are defines for the bit fields in the HR_ADCPPBOFFCAL register
//
//*************************************************************************************************
#define HR_ADC_PPB1OFFCAL_OFFCAL_S 0U
#define HR_ADC_PPB1OFFCAL_OFFCAL_M 0x3FFU // HR_ADC Post Processing Block 1 Offset Correction

//*************************************************************************************************
//
// The following are defines for the bit fields in the HR_ADCPPBCONFIG register
//
//*************************************************************************************************
#define HR_ADC_PPB2CONFIG_CONFIG_S   0U
#define HR_ADC_PPB2CONFIG_CONFIG_M   0x1fU // HR_ADC Post Processing Block 2 Configuration
#define HR_ADC_PPB2CONFIG_TWOSCOMPEN 0x20U // HR_ADC Post Processing Block 2 Two's Complement Enable
#define HR_ADC_PPB2CONFIG_CBCEN      0x40U // HR_ADC Post Processing Block 2 Cycle By Cycle Enable

//*************************************************************************************************
//
// The following are defines for the bit fields in the HR_ADCPPBSTAMP register
//
//*************************************************************************************************
#define HR_ADC_PPB2STAMP_DLYSTAMP_S 0U
#define HR_ADC_PPB2STAMP_DLYSTAMP_M 0xFFFU // HR_ADC Post Processing Block 2 Delay Time Stamp

//*************************************************************************************************
//
// The following are defines for the bit fields in the HR_ADCPPBOFFREF register
//
//*************************************************************************************************
#define HR_ADC_PPB2OFFREF_OFFREF_S 0U
#define HR_ADC_PPB2OFFREF_OFFREF_M 0xFFFFU // HR_ADC Post Processing Block 2 Offset Correction

//*************************************************************************************************
//
// The following are defines for the bit fields in the HR_ADCPPBTRIPHI register
//
//*************************************************************************************************
#define HR_ADC_PPB2TRIPHI_LIMITHI_S 0U
#define HR_ADC_PPB2TRIPHI_LIMITHI_M 0xFFFU  // HR_ADC Post Processing Block 2 Trip High Limit
#define HR_ADC_PPB2TRIPHI_HSIGN     0x1000U // HR_ADC Post Processing Block 2 High Limit Sign Bit

//*************************************************************************************************
//
// The following are defines for the bit fields in the HR_ADCPPBTRIPLO register
//
//*************************************************************************************************
#define HR_ADC_PPB2TRIPLO_LIMITLO_S  0U
#define HR_ADC_PPB2TRIPLO_LIMITLO_M  0xFFFU  // HR_ADC Post Processing Block 2 Trip Low Limit
#define HR_ADC_PPB2TRIPLO_LSIGN      0x1000U // HR_ADC Post Processing Block 2 Low Limit Sign Bit
#define HR_ADC_PPB2TRIPLO_REQSTAMP_S 20U
#define HR_ADC_PPB2TRIPLO_REQSTAMP_M \
    0xFFF00000U // HR_ADC Post Processing Block 2 Request Time Stamp

//*************************************************************************************************
//
// The following are defines for the bit fields in the HR_ADCPPBOFFCAL register
//
//*************************************************************************************************
#define HR_ADC_PPB2OFFCAL_OFFCAL_S 0U
#define HR_ADC_PPB2OFFCAL_OFFCAL_M 0x3FFU // HR_ADC Post Processing Block 2 Offset Correction

//*************************************************************************************************
//
// The following are defines for the bit fields in the HR_ADCPPBCONFIG register
//
//*************************************************************************************************
#define HR_ADC_PPB3CONFIG_CONFIG_S   0U
#define HR_ADC_PPB3CONFIG_CONFIG_M   0x1fU // HR_ADC Post Processing Block 3 Configuration
#define HR_ADC_PPB3CONFIG_TWOSCOMPEN 0x20U // HR_ADC Post Processing Block 3 Two's Complement Enable
#define HR_ADC_PPB3CONFIG_CBCEN      0x40U // HR_ADC Post Processing Block 3 Cycle By Cycle Enable

//*************************************************************************************************
//
// The following are defines for the bit fields in the HR_ADCPPBSTAMP register
//
//*************************************************************************************************
#define HR_ADC_PPB3STAMP_DLYSTAMP_S 0U
#define HR_ADC_PPB3STAMP_DLYSTAMP_M 0xFFFU // HR_ADC Post Processing Block 3 Delay Time Stamp

//*************************************************************************************************
//
// The following are defines for the bit fields in the HR_ADCPPBOFFREF register
//
//*************************************************************************************************
#define HR_ADC_PPB3OFFREF_OFFREF_S 0U
#define HR_ADC_PPB3OFFREF_OFFREF_M 0xFFFFU // HR_ADC Post Processing Block 3 Offset Correction

//*************************************************************************************************
//
// The following are defines for the bit fields in the HR_ADCPPBTRIPHI register
//
//*************************************************************************************************
#define HR_ADC_PPB3TRIPHI_LIMITHI_S 0U
#define HR_ADC_PPB3TRIPHI_LIMITHI_M 0xFFFU  // HR_ADC Post Processing Block 3 Trip High Limit
#define HR_ADC_PPB3TRIPHI_HSIGN     0x1000U // HR_ADC Post Processing Block 3 High Limit Sign Bit

//*************************************************************************************************
//
// The following are defines for the bit fields in the HR_ADCPPBTRIPLO register
//
//*************************************************************************************************
#define HR_ADC_PPB3TRIPLO_LIMITLO_S  0U
#define HR_ADC_PPB3TRIPLO_LIMITLO_M  0xFFFU  // HR_ADC Post Processing Block 3 Trip Low Limit
#define HR_ADC_PPB3TRIPLO_LSIGN      0x1000U // HR_ADC Post Processing Block 3 Low Limit Sign Bit
#define HR_ADC_PPB3TRIPLO_REQSTAMP_S 20U
#define HR_ADC_PPB3TRIPLO_REQSTAMP_M \
    0xFFF00000U // HR_ADC Post Processing Block 3 Request Time Stamp

//*************************************************************************************************
//
// The following are defines for the bit fields in the HR_ADCPPBOFFCAL register
//
//*************************************************************************************************
#define HR_ADC_PPB3OFFCAL_OFFCAL_S 0U
#define HR_ADC_PPB3OFFCAL_OFFCAL_M 0x3FFU // HR_ADC Post Processing Block 3 Offset Correction

//*************************************************************************************************
//
// The following are defines for the bit fields in the HR_ADCPPBCONFIG register
//
//*************************************************************************************************
#define HR_ADC_PPB4CONFIG_CONFIG_S   0U
#define HR_ADC_PPB4CONFIG_CONFIG_M   0x1fU // HR_ADC Post Processing Block 4 Configuration
#define HR_ADC_PPB4CONFIG_TWOSCOMPEN 0x20U // HR_ADC Post Processing Block 4 Two's Complement Enable
#define HR_ADC_PPB4CONFIG_CBCEN      0x40U // HR_ADC Post Processing Block 4 Cycle By Cycle Enable

//*************************************************************************************************
//
// The following are defines for the bit fields in the HR_ADCPPBSTAMP register
//
//*************************************************************************************************
#define HR_ADC_PPB4STAMP_DLYSTAMP_S 0U
#define HR_ADC_PPB4STAMP_DLYSTAMP_M 0xFFFU // HR_ADC Post Processing Block 4 Delay Time Stamp

//*************************************************************************************************
//
// The following are defines for the bit fields in the HR_ADCPPBOFFREF register
//
//*************************************************************************************************
#define HR_ADC_PPB4OFFREF_OFFREF_S 0U
#define HR_ADC_PPB4OFFREF_OFFREF_M 0xFFFFU // HR_ADC Post Processing Block 4 Offset Correction

//*************************************************************************************************
//
// The following are defines for the bit fields in the HR_ADCPPBTRIPHI register
//
//*************************************************************************************************
#define HR_ADC_PPB4TRIPHI_LIMITHI_S 0U
#define HR_ADC_PPB4TRIPHI_LIMITHI_M 0xFFFU  // HR_ADC Post Processing Block 4 Trip High Limit
#define HR_ADC_PPB4TRIPHI_HSIGN     0x1000U // HR_ADC Post Processing Block 4 High Limit Sign Bit

//*************************************************************************************************
//
// The following are defines for the bit fields in the HR_ADCPPBTRIPLO register
//
//*************************************************************************************************
#define HR_ADC_PPB4TRIPLO_LIMITLO_S  0U
#define HR_ADC_PPB4TRIPLO_LIMITLO_M  0xFFFU  // HR_ADC Post Processing Block 4 Trip Low Limit
#define HR_ADC_PPB4TRIPLO_LSIGN      0x1000U // HR_ADC Post Processing Block 4 Low Limit Sign Bit
#define HR_ADC_PPB4TRIPLO_REQSTAMP_S 20U
#define HR_ADC_PPB4TRIPLO_REQSTAMP_M \
    0xFFF00000U // HR_ADC Post Processing Block 4 Request Time Stamp

//*************************************************************************************************
//
// The following are defines for the bit fields in the HR_ADCPPBOFFCAL register
//
//*************************************************************************************************
#define HR_ADC_PPB4OFFCAL_OFFCAL_S 0U
#define HR_ADC_PPB4OFFCAL_OFFCAL_M 0x3FFU // HR_ADC Post Processing Block 4 Offset Correction

//*************************************************************************************************
//
// The following are defines for the bit fields in the HR_ADCPPB1RESULT register
//
//*************************************************************************************************
#define HR_ADC_PPB1RESULT_PPBRESULT_S 0U
#define HR_ADC_PPB1RESULT_PPBRESULT_M 0xFFFU // HR_ADC Post Processing Block 1 Result
#define HR_ADC_PPB1RESULT_SIGN_S      12U
#define HR_ADC_PPB1RESULT_SIGN_M      0xFFFFF000U // Sign Extended Bits

//*************************************************************************************************
//
// The following are defines for the bit fields in the HR_ADCPPB2RESULT register
//
//*************************************************************************************************
#define HR_ADC_PPB2RESULT_PPBRESULT_S 0U
#define HR_ADC_PPB2RESULT_PPBRESULT_M 0xFFFU // HR_ADC Post Processing Block 2 Result
#define HR_ADC_PPB2RESULT_SIGN_S      12U
#define HR_ADC_PPB2RESULT_SIGN_M      0xFFFFF000U // Sign Extended Bits

//*************************************************************************************************
//
// The following are defines for the bit fields in the HR_ADCPPB3RESULT register
//
//*************************************************************************************************
#define HR_ADC_PPB3RESULT_PPBRESULT_S 0U
#define HR_ADC_PPB3RESULT_PPBRESULT_M 0xFFFU // HR_ADC Post Processing Block 3 Result
#define HR_ADC_PPB3RESULT_SIGN_S      12U
#define HR_ADC_PPB3RESULT_SIGN_M      0xFFFFF000U // Sign Extended Bits

//*************************************************************************************************
//
// The following are defines for the bit fields in the HR_ADCPPB4RESULT register
//
//*************************************************************************************************
#define HR_ADC_PPB4RESULT_PPBRESULT_S 0U
#define HR_ADC_PPB4RESULT_PPBRESULT_M 0xFFFU // HR_ADC Post Processing Block 4 Result
#define HR_ADC_PPB4RESULT_SIGN_S      12U
#define HR_ADC_PPB4RESULT_SIGN_M      0xFFFFF000U // Sign Extended Bits

