QX-C2000-DSP/f280049revb_evb_examples/libs/driverlib/inc/hw_hradc.h
//*************************************************************************************************
//
// The following are defines for the bit fields in the HR_ADCSOCFRC1 register
//
//*************************************************************************************************
#define HR_ADC_SOCFRC1_SOC0  0x1U     // SOC0 Force Start of Conversion Bit
#define HR_ADC_SOCFRC1_SOC1  0x2U     // SOC1 Force Start of Conversion Bit
#define HR_ADC_SOCFRC1_SOC2  0x4U     // SOC2 Force Start of Conversion Bit
#define HR_ADC_SOCFRC1_SOC3  0x8U     // SOC3 Force Start of Conversion Bit
#define HR_ADC_SOCFRC1_SOC4  0x10U    // SOC4 Force Start of Conversion Bit
#define HR_ADC_SOCFRC1_SOC5  0x20U    // SOC5 Force Start of Conversion Bit
#define HR_ADC_SOCFRC1_SOC6  0x40U    // SOC6 Force Start of Conversion Bit
#define HR_ADC_SOCFRC1_SOC7  0x80U    // SOC7 Force Start of Conversion Bit
#define HR_ADC_SOCFRC1_SOC8  0x100U   // SOC8 Force Start of Conversion Bit
#define HR_ADC_SOCFRC1_SOC9  0x200U   // SOC9 Force Start of Conversion Bit
#define HR_ADC_SOCFRC1_SOC10 0x400U   // SOC10 Force Start of Conversion Bit
#define HR_ADC_SOCFRC1_SOC11 0x800U   // SOC11 Force Start of Conversion Bit
#define HR_ADC_SOCFRC1_SOC12 0x1000U  // SOC12 Force Start of Conversion Bit
#define HR_ADC_SOCFRC1_SOC13 0x2000U  // SOC13 Force Start of Conversion Bit
#define HR_ADC_SOCFRC1_SOC14 0x4000U  // SOC14 Force Start of Conversion Bit
#define HR_ADC_SOCFRC1_SOC15 0x8000U  // SOC15 Force Start of Conversion Bit
#define HR_ADC_SOCFRC1_SOC16 0x10000U // SOC16 Force Start of Conversion Bit
#define HR_ADC_SOCFRC1_SOC17 0x20000U // SOC17 Force Start of Conversion Bit
#define HR_ADC_SOCFRC1_SOC18 0x40000U // SOC18 Force Start of Conversion Bit
#define HR_ADC_SOCFRC1_SOC19 0x80000U // SOC19 Force Start of Conversion Bit
//*****************************************************************************
//
// Useful defines used within the driver functions. Not intended for use by
// application code.
//
//*****************************************************************************
#define HR_ADC_NUM_INTERRUPTS 1U

#define HR_ADC_SOCxCTL_OFFSET_BASE    HR_ADC_O_SOC0CTL
#define HR_ADC_RESULTx_OFFSET_BASE    HR_ADC_O_RESULT0
#define HR_ADC_INTSELxNy_OFFSET_BASE  HR_ADC_O_INTSEL1N2
#define HR_ADC_PPBxRESULT_OFFSET_BASE (HR_ADC_O_PPB2RESULT - HR_ADC_O_PPB1RESULT)

#define HR_ADC_PPBxCONFIG_STEP (HR_ADC_O_PPB2CONFIG - HR_ADC_O_PPB1CONFIG)
#define HR_ADC_PPBxTRIPHI_STEP (HR_ADC_O_PPB2TRIPHI - HR_ADC_O_PPB1TRIPHI)
#define HR_ADC_PPBxTRIPLO_STEP (HR_ADC_O_PPB2TRIPLO - HR_ADC_O_PPB1TRIPLO)
#define HR_ADC_PPBxSTAMP_STEP  (HR_ADC_O_PPB2STAMP - HR_ADC_O_PPB1STAMP)
#define HR_ADC_PPBxOFFCAL_STEP (HR_ADC_O_PPB2OFFCAL - HR_ADC_O_PPB1OFFCAL)
#define HR_ADC_PPBxOFFREF_STEP (HR_ADC_O_PPB2OFFREF - HR_ADC_O_PPB1OFFREF)

#define HR_ADC_PPBTRIP_MASK \
    ((uint32_t)HR_ADC_PPB1TRIPHI_LIMITHI_M | (uint32_t)HR_ADC_PPB1TRIPHI_HSIGN)
// #define HR_ADC_INT_REF_TSSLOPE         (*(int16_t *)((uintptr_t)0x710D5))
// #define HR_ADC_INT_REF_TSOFFSET        (*(int16_t *)((uintptr_t)0x710D6))
// #define HR_ADC_EXT_REF_TSSLOPE         (*(int16_t *)((uintptr_t)0x710D3))
// #define HR_ADC_EXT_REF_TSOFFSET        (*(int16_t *)((uintptr_t)0x710D4))

#ifndef DOXYGEN_PDF_IGNORE
//*****************************************************************************
//
// Values that can be passed to HR_ADC_enablePPBEvent(), HR_ADC_disablePPBEvent(),
// HR_ADC_enablePPBEventInterrupt(), HR_ADC_disablePPBEventInterrupt(), and
// HR_ADC_clearPPBEventStatus() as the intFlags and evtFlags parameters. They also
// make up the enumerated bit field returned by HR_ADC_getPPBEventStatus().
//
//*****************************************************************************
#define HR_ADC_EVT_TRIPHI 0x0001U //!< Trip High Event
#define HR_ADC_EVT_TRIPLO 0x0002U //!< Trip Low Event
#define HR_ADC_EVT_ZERO   0x0004U //!< Zero Crossing Event

//*****************************************************************************
//
// Values that can be passed to HR_ADC_forceMultipleSOC() as socMask parameter.
// These values can be OR'd together to trigger multiple SOCs at a time.
//
//*****************************************************************************
#define HR_ADC_FORCE_SOC0  0x0001U  //!< SW trigger HR_ADC SOC 0
#define HR_ADC_FORCE_SOC1  0x0002U  //!< SW trigger HR_ADC SOC 1
#define HR_ADC_FORCE_SOC2  0x0004U  //!< SW trigger HR_ADC SOC 2
#define HR_ADC_FORCE_SOC3  0x0008U  //!< SW trigger HR_ADC SOC 3
#define HR_ADC_FORCE_SOC4  0x0010U  //!< SW trigger HR_ADC SOC 4
#define HR_ADC_FORCE_SOC5  0x0020U  //!< SW trigger HR_ADC SOC 5
#define HR_ADC_FORCE_SOC6  0x0040U  //!< SW trigger HR_ADC SOC 6
#define HR_ADC_FORCE_SOC7  0x0080U  //!< SW trigger HR_ADC SOC 7
#define HR_ADC_FORCE_SOC8  0x0100U  //!< SW trigger HR_ADC SOC 8
#define HR_ADC_FORCE_SOC9  0x0200U  //!< SW trigger HR_ADC SOC 9
#define HR_ADC_FORCE_SOC10 0x0400U  //!< SW trigger HR_ADC SOC 10
#define HR_ADC_FORCE_SOC11 0x0800U  //!< SW trigger HR_ADC SOC 11
#define HR_ADC_FORCE_SOC12 0x1000U  //!< SW trigger HR_ADC SOC 12
#define HR_ADC_FORCE_SOC13 0x2000U  //!< SW trigger HR_ADC SOC 13
#define HR_ADC_FORCE_SOC14 0x4000U  //!< SW trigger HR_ADC SOC 14
#define HR_ADC_FORCE_SOC15 0x8000U  //!< SW trigger HR_ADC SOC 15
#define HR_ADC_FORCE_SOC16 0x10000U //!< SW trigger HR_ADC SOC 16
#define HR_ADC_FORCE_SOC17 0x20000U //!< SW trigger HR_ADC SOC 17
#define HR_ADC_FORCE_SOC18 0x40000U //!< SW trigger HR_ADC SOC 18
#define HR_ADC_FORCE_SOC19 0x80000U //!< SW trigger HR_ADC SOC 19

#endif
// ####
#endif
